[
    {
        "title": "NASA's Mars 2020 Rover Closer to Getting Its Name",
        "preview": "155 students from across the U.S. have been chosen as semifinalists in NASA's essay contest to name the Mars 2020 rover, and see it launch from Cape Canaveral this July."
    },
    {
        "title": "Mars InSight Lander to Push on Top of the 'Mole'",
        "preview": "Engineers have a plan for pushing down on the heat probe, which has been stuck at the Martian surface for a year."
    },
    {
        "title": "Nine Finalists Chosen in NASA's Mars 2020 Rover Naming Contest",
        "preview": "Nine finalists have been chosen in the essay contest for K-12 students across U.S. to name NASA's next Mars rover. Now you can help by voting for your favorite. "
    },
    {
        "title": "The Detective Aboard NASA's Perseverance Rover",
        "preview": "An instrument called SHERLOC will, with the help of its partner WATSON, hunt for signs of ancient life by detecting organic molecules and minerals."
    },
    {
        "title": "While Stargazing on Mars, NASA's Curiosity Rover Spots Earth and Venus",
        "preview": "This new portrait of the Red Planet's neighbors was taken during a time when there's more dust in the air on Mars."
    },
    {
        "title": "My Culture, My Voice",
        "preview": "In honor of Hispanic Heritage Month, Christina Hernandez, an instrument engineer on the Mars 2020 mission, talks about her childhood and journey to NASA."
    },
    {
        "title": "Air Deliveries Bring NASA's Perseverance Mars Rover Closer to Launch",
        "preview": "A NASA Wallops Flight Facility cargo plane transported more than two tons of equipment — including the rover's sample collection tubes — to Florida for this summer's liftoff."
    },
    {
        "title": "Mars Is Getting a New Robotic Meteorologist",
        "preview": "Sensors on NASA's Perseverance will help prepare for future human exploration by taking weather measurements and studying dust particles."
    },
    {
        "title": "The Launch Is Approaching for NASA's Next Mars Rover, Perseverance",
        "preview": "The Red Planet's surface has been visited by eight NASA spacecraft. The ninth will be the first that includes a roundtrip ticket in its flight plan. "
    },
    {
        "title": "NASA's Push to Save the Mars InSight Lander's Heat Probe",
        "preview": "The scoop on the end of the spacecraft's robotic arm will be used to 'pin' the mole against the wall of its hole."
    },
    {
        "title": "Mars Scientists Investigate Ancient Life in Australia",
        "preview": "Teams with NASA's Mars 2020 and ESA's ExoMars practiced hunting for fossilized microbial life in the Australian Outback in preparation for their Red Planet missions. "
    },
    {
        "title": "NASA's Mars 2020 Rover Tests Descent-Stage Separation",
        "preview": "A crane lifts the rocket-powered descent stage away from NASA's Mars 2020 rover after technicians tested the pyrotechnic charges that separate the two spacecraft."
    },
    {
        "title": "Celebrate Mars Reconnaissance Orbiter's Views From Above",
        "preview": "Marking its 15th anniversary since launch, one of the oldest spacecraft at the Red Planet has provided glimpses of dust devils, avalanches, and more."
    },
    {
        "title": "7 Things to Know About the Mars 2020 Perseverance Rover Mission",
        "preview": "NASA's next rover to the Red Planet is slated to launch no earlier than July 30. These highlights will get you up to speed on the ambitious mission."
    },
    {
        "title": "Common Questions about InSight's 'Mole'",
        "preview": "The following Q&As with members of the team answer some of the most common questions about the burrowing device, part of a science instrument called the Heat Flow and Physical Properties Package (HP3)."
    }
]